const Discord = require("discord.js");
const client = new Discord.Client();
var prefix = "--";
client.on('message', message => {
    if (message.content == "--سرعه") {
        var x = ["DreamKing",
"DeathGames",
"زيرو كنج",
"أرض الأحلام",
"ألبرازيل",
"العراق",
"ألمملكة ألعربية ألسعودية",
"القسطنطينية",
"النهاية",
"امازون",
"جافاسكربت",
"سهله مو صعبه",
"طبق رطب مرق بقر",
"متجر",
"شجرة الأوغيري",
"عش العصفور",
"هلا بلخميس",
"الحوت الأزرق",
"بلاد الرافدين",
"كانيكي",
"توكا",
"عادل امام",
"عمرو ذياب",
"عمان",
"مسقط",
"بغداد عاصمة العراق",
"Playing Minecraft",
"Music",
"FaceBooK",
"YouTube",
"Infinity",
"احبك دريم",
"Don't Let Me Down",
"Space",
"Instgram",
"Google",
"Viber",
];
        var x2 = ['DreamKing',
        "DeathGames",
        "زيرو كنج",
        "أرض الأحلام",
		"ألبرازيل",
		"العراق",
		"ألمملكة ألعربية ألسعودية",
		"القسطنطينية",
		"النهاية",
		"امازون",
		"جافاسكربت",
		"سهله مو صعبه",
		"طبق رطب مرق بقر",
		"متجر",
		"شجرة الأوغيري",
		"عش العصفور",
		"هلا بلخميس",
		"الحوت الأزرق",
        "بلاد الرافدين",
        "كانيكي",
        "توكا",
        "عادل امام",
        "عمرو ذياب",
        "عمان",
        "مسقط",
        "بغداد عاصمة العراق",
        "Playing Minecraft",
        "Music",
        "FaceBooK",
        "YouTube",
        "Infinity",
        "احبك دريم",
        "Don't Let Me Down",
		"Space",
		"Instgram",
		"Google",
		"Viber",
		
        
        
        
        
        ];
        
        var x3 = Math.floor(Math.random()*x.length)
        message.channel.send(` اول شخص يكتب :  __**${x[x3]}**__
لديك 15 ثانية للاجابة`).then(msg1=> {
            var r = message.channel.awaitMessages(msg => msg.content == x2[x3], {
                maxMatches : 1,
                time : 15000,
                errors : ['time']
            })
        r.catch(() => {
            return message.channel.send(`:negative_squared_cross_mark: لقد انتهى الوقت ولم يقم أحد بالأجابة بشكل صحيح 
            الإجآبة الصحيحةة هي __**${x2[x3]}**__`)
        })
        
        r.then((collected)=> {
            message.channel.send(`${collected.first().author} لقد قمت بكتابة الكلمة في الوقت المناسب  `);
        })
        })
    }
})

client.on('message', puz => {
    if (puz.content == "--لغز") {
        var x = ["ما هي حاسة الشم عند الثعبان ؟",
"ما هو الشي الذي يكسو الناس و هو عار بدون ملابس ؟",
"ما هو الشي الذي لا يجري و لا يمشي ؟",
"ما هو إسم الشهر الميلادي الذي إذا حذفت أوله , تحول إلى إسم فاكهه ؟",
"ما هو الشي الذي لا يدخل الإ إذا ضرب على رأسه ؟",
"ما هو الشيء الذي اسمه على لونه ؟",
"ما هو الشي الذي كلما زاد نقص ؟",
"ما هي التي تحرق نفسها لتفيد غيرها ؟",
"كله ثقوب و مع ذلك يحفظ الماء ؟",
"ما هو الذي لحمه من الداخل و عظمه من الخارج ؟",
"يستطيع ان يخترق الزجاج من دون كسره .. فما هو ؟",
];
        var x2 = ['اللسان',
		"الابره",
        "الماء",
		"تموز",
		"المسمار",
		"البيضة",
		"العمر",
		"الشمعة",
		"الاسفنج",
		"السلحفاة",
		"الضوء",
        
        
        
        
        ];
        
        var x3 = Math.floor(Math.random()*x.length)
        puz.channel.send(`السؤال هو:  __**${x[x3]}**__
لديك 20 ثانية للاجابة`).then(msg1=> {
            var r = puz.channel.awaitMessages(msg => msg.content == x2[x3], {
                maxMatches : 1,
                time : 20000,
                errors : ['time']
            })
        r.catch(() => {
            return puz.channel.send(`:negative_squared_cross_mark: لقد انتهى الوقت ولم يقم أحد بالأجابة بشكل صحيح 
            `)
        })
        
        r.then((collected)=> {
            puz.channel.send(`${collected.first().author} لقد قمت بحل اللغز في الوقت المناسب  `);
        })
        })
    }
})

client.on('message', fkk => {
    if (fkk.content == "--فكك") {
        var x = ["المتاح للجميع لا يتاح لي",
"خعاخع",
"فيلا",
"بريء",
"بسم الله الرحمن الرحيم",
"الضرورة",
"دنيا",
"صارم",
"مات",
"شعبان شبعان",
"ألعراق",
];
        var x2 = ['ا ل م ت ا ح ل ل ج م ي ع ل ا ي ت ا ح ل ى',
		"خ ع ا خ ع",
        "ف ي ل ا",
		"ب ر ي ء",
		"ب س م ا ل ل ه ا ل ر ح م ن ا ل ر ح ي م",
		"ا ل ض ر و ر ة",
		"د ن ي ا",
		"ص ا ر م",
		"م ا ت",
		"ش ع ب ا ن ش ب ع ا ن",
		"أ ل ع ر ا ق",
        
        
        
        
        ];
        
        var x3 = Math.floor(Math.random()*x.length)
        fkk.channel.send(`اول شخص يفكك :  __**${x[x3]}**__
لديك 15 ثانية للاجابة`).then(msg1=> {
            var r = fkk.channel.awaitMessages(msg => msg.content == x2[x3], {
                maxMatches : 1,
                time : 15000,
                errors : ['time']
            })
        r.catch(() => {
            return fkk.channel.send(`:negative_squared_cross_mark: لقد انتهى الوقت ولم يقم أحد بالأجابة بشكل صحيح 
            الإجآبة الصحيحةة هي __**${x2[x3]}**__`)
        })
        
        r.then((collected)=> {
            fkk.channel.send(`${collected.first().author} لقد قمت بفكيك الجملة في الوقت المناسب`);
        })
        })
    }
})

client.on('message', kut => {
    if (kut.content == "--كت") {
         var x = ["ماذا اخترت من الأفلام لسهرتك؟",
            "لَون تتفاءل فيه؟",
            "كم شخص يعرف قفل هاتفك؟",
            "اسم لطفلين توأم ولد ووبنت، جميل وجديد؟",
            "هل لديك ذلك الشخص الذي تلجأ إليه في قراراتك المصيرية؟",
            "هل سبق وابتعدت عن أحدهم ثم ندمت؟",
            "أحببت شخص ورفضك، هل تحاول من جديد أم تنسحب؟",
            "أول شيء يخطر في بالك إذا سمعت كلمة فضاء؟",
            "أجمل شيء حصل معك هذا اليوم؟",
            "آخر شيء بحثت عنه في #Google؟",
            "يُقال أن الشخص كثير العصبية طيب القلب هل تصح هذه المقولة دائمًا؟",
            "هل مر فى حياتك شخص كنت تعتبره محل ثقة، ثم اكتشفت أنه محل أحذية؟",
            "عندي فوبيــا مِن؟",
            "موهبة تتمنى لو كانت لديك؟",
            "لماذا يختار البعض المال قبل الصحة؟",
            "أود أن أعلنها وأقول ....؟",
            "ماذا سترد عندما تُوجّه لك هذه الجملة الحياة جميلة بس تحتاج مين يفهمه؟",
            "اسوء شي اكلته في حياتك؟",
            "نسبة التقلبات في مزاجك هالفترة من 10؟",
            "شاعر تُحب أن تقرأ له؟",
            "في اعتقادك، متى بدأت فكرة التطبيل لأحدهم في هذه الدنيا؟",
            "لو أتيح لك تأسيس دولة على المريخ، ماذا ستختار اسمًا لها؟",
            "كيف يمكن للشخص أن يتخلص من الأفكار السلبية؟",
            "أكثر وأسرع شيء يحسن مزاجك؟",
            "ربحت جائزة لزيارة القمر ويمكنك استبدالها بالمبلغ المالي، ما اختيارك؟",
            "لو قررنا أن نُلغى عادة من عادات الزواج المكلفة.. ماذا سنلغي كنوع من التيسير على الطرفين؟",
            "أشياء من الماضي تشتاق إليها؟",
            "كيف تأخذ قهوتك في العادة؟",
            "آخر مرة وصلتك رسالة جعلتك تبتسم؟",
            "يوتيوبر تعجبك مقاطعه؟",
            "من يساعدك في اختيار ملابسك عادة؟",
            "ما موقفك إذا أجبرتك كل الظروف على العيش مع شخص لا تجد سعادتك معه؟",
            "في هذه الساعة، أتمنى لو .....؟",
            "هل يتغير الرجل متعدد العلاقات بعد الزواج؟",
            "شخص يشك في خيانة الحبيب/ة هل يواجهه مباشرة أم ينتظر للتأكد؟",
            "ما هو التغيير الجذري في حياتك الذي جعلك أقوى؟",
            "ردة فعلك لو أوقفتك قوة خاصة من الشرطة وقالت هذا هو المجرم اعتقلووه؟",
            "ملخص يومك في كلمة؟",
            "عادة سيئة فيك؟",
            "هل لديك ذلك الشخص المقرّب الذي إذا قلت أبيخ نكتة مستعد يضحك عليها من قلبه؟",
            "عندما تجد من يُكمِّلك تمسك به هل تتفق مع المقولة؟",
            "كلما قلّت علاقات ارتحت أكثر مع أو ضد؟",
            "في الفترة الحالية، مَن المنتصر؟ 1. قلبك 2. عقلك 3. ما أدري",
            "رجل يكره زوجته جدا لأسباب كبيره لا يحترمها ولكن يبرر لها افعاله مـالسبب..؟",
            "هل يوجد شخص في حياتك لا تمل من سواليفه؟",
            "تفضّل تربية؟ 1. حيوان أليف 2. طيور",
            "تضع غطاء حماية لهاتفك أم تحب مظهره كما هو؟",
            "هل سبق وندمت على رفضك لحب أحدهم؟",
            "تعريفك للسفر .. ؟",
            "آخر مرة ربحت في مسابقة؟",
            "أشياء متخوّف منها في المستقبل؟",
            "كم عظيمًا لو .....؟",
            "أبناء العم أم أبناء الخال أقرب لك؟",
            "لو عاد بك الزمن 10 سنوات، ما أكثر شيء ستركز على تغييره؟",
            "اضحك بثاني حرف من اسمك؟",
            "أحب أكلة عندك؟",
            "تشعر بالبرود الكبير تجاه علاقتك مع الشخص المقرّب لكنك متخوّف من خسارته.. كيف تتصرف؟",
            "نسبة اللامبالاة عندك هالفترة؟",
            "أكثر حيوان تقف عنده خلال زيارتك لحديقة الحيوان؟",
            "أكتب لنا بيت شعر من تأليفك؟",
            "شخصية المُستفزة بالنسبة لك؟",
            "صِف لنا كيف تتخيّل شعورك لو ربحت سيارة أحلامك؟",
            "الذكريات لشخص تركك كيف انساها",
            "لديك ذلك الشخص الذي تخبره بجميع همومك ويستمع دائمًا؟",
            "للإناث | الزواج من رجل تحبينه أو من شخص أمك تراه الأفضل لكِ؟",
            "للإناث | أكثر طبع تكرهينه في الرجل؟",
            "آخر مرة شعرت أنك تعاني من النسيان بشكل غريب؟",
            "شخص يقول: كيف ألفت انتباه مَن أحب؟",
            "أكثر شيء تفعله عند الشعور بقمة الملل؟",
            "للإناث | لو تقدّم لك عريس مغترب، توافقين؟",
            "إذا جازَ لك أن تسرق شيئًا ويصبح ملكك، ماذا ستسرق؟",
            "هل يوجد مَن لا يُحب القهوة؟",
            "كلمة توجه لخليل من قلبك",
            "كهل أنت من الأشخاص الذي يدونون يومياتهم؟",
            "فاكهة لا تمل منها؟",
            "وظيفة لطالما حلمت بها؟",
            "متى يكون الإنسحاب طيب وبدون تأنيب ضمير؟",
            "أكلة تود تجربتها بقوة؟",
            "صريح | كم مرة أحببت بصدق للآن؟",
            "شخص مقرب أرسل لك يقول: أتركني وشأني ردة فعلك؟",
            "فنان/ة تود أن يقيم حفل في مدينتك؟",
            "هل ﺗﺘﻮﻗﻊ أﻧﻚ ﻣﻮﺟﻮﺩ ﺑﻘﻠﺐ أحدهم ﺍلآن؟",
            "شخصية المُستفزة بالنسبة لك؟",
            "ماذا سيحدث إذا توقفت عن الخوف وذهبت فقط إلى من تريد؟",
            "أول شيء يخطر في بالك إذا سمعت كلمة عُقاب؟",
            "ما هي الحالات التي تلتزم فيها الصمت؟",
            "ما الحل في أمل كلما سعيت إليه تتعقد أمورك وتعود للبداية وكذالك ان تجاهلته ولم تسعى في تحقيقه مع رغبتك الملحة به لكن كل الطرق بأت بالفشل ...؟",
            "هل تفعل ما تقوله دومًا؟",

        ];


       var x3 = Math.floor(Math.random()*x.length)
        kut.channel.send(`السؤال هو:  __**${x[x3]}**`).then(msg1=> {

        })
    }
})


client.on('message', message => {
  var helplist = `**  قائمة الاوامر  

>  البرفكس الخاص بالبوت هو [--] 
>  : الألعاب الخاصة بالبوت 
> سرعه 
> لغز
> فكك 
> كت 
**`
  
  if(message.content === prefix + 'help') {
            message.delete(1000)
    let e = '** جاري الارســال .. :envelope_with_arrow: **'
	  message.reply(e).then(m => m.delete(1000))
	  message.author.send(helplist).catch(error => message.reply('** لم اتمكن من الارسال الاوامر لك , يرجي فتح خاصك :negative_squared_cross_mark:**'))
}
});


client.on('ready', () => {
   console.log(`----------------`);
      console.log(`Script By : Khalil`);
        console.log(`----------------`);
      console.log(`ON ${client.guilds.size} Servers '     Script By : Khalil ' `);
    console.log(`----------------`);
  console.log(`Logged in as ${client.user.tag}!`);
client.user.setActivity(`Type ${prefix}help`,{type: 'Playing'});

});



client.login(process.env.BOT_TOKEN);// لا تغير فيها شيء
